/*******************
Function: 用定时器 1 查询方式来改变网蜂功能底板上 LED1 灯状态， T1 每溢出两次，
LED1 闪烁一次。
Author:ZT
Date:2025-03-28
Version:V1.0
*******************/
#include <ioCC2530.h>
typedef unsigned char uchar;
typedef unsigned int uint;
#define LED1 P1_0// P1.0 口控制 LED1
#define LED2 P1_1// P1.1 口控制 LED2
#define LED3 P1_4// P1.1 口控制 LED2
/****************************************************************************
*名称: InitLed()
*功能:设置 LED 灯相应的 IO 口
*入口参数:无
*出口参数:无
****************************************************************************/
void InitLed(void)
{
  P1DIR |= 0x13;//P1.0 定义为输出
  LED1 = 1;//使 LED1 灯上电默认为熄灭
  LED2 = 1;
  LED3 = 1;
}
/****************************************************************************
*名称: InitT1()
*功能:定时器初始化，系统不配置工作时钟时默认是 2 分频，即 16MHz
*入口参数:无
*出口参数:无
****************************************************************************/
void InitT1()
{
  T1CTL = 0x0d;//128 分频,自动重装 0x0000-0xFFFF
  T1STAT= 0x21;//通道 0,中断有效
}
/****************************************************************************
*程序入口函数
****************************************************************************/
void main()
{
 uchar count = 0;
 InitLed();
 InitT1();
 while(1)
 {
  if(IRCON>0)
  {
   IRCON=0;
   if(++count>=0.5)
   {
    count = 0;
    LED1 = !LED1;
    LED2 = !LED2;
    LED3 = !LED3;
   }
  }
 }
}