/**************************************************************************** 
Function: 实现按键S1控制LED1灯亮灭、按键S2控制LED2闪烁、按键S1控制跑马灯、按键S2控制LED1、LED2、LED3同时闪烁。
Author:   ZT
Date: 2025-03-16 
Version: V1.0 
****************************************************************************/ 

#include <ioCC2530.h> 
typedef unsigned char uchar; 
typedef unsigned int   uint; 

#define LED1 P1_0 // P1.0口控制LED1 
#define LED2 P1_1 // P1.1口控制LED2 
#define LED3 P1_4 // P1.2口控制LED3 
#define S1 P0_0  // P0.0口控制S1 
#define S2 P0_1  // P0.1口控制S2 

/**************************************************************************** 
// 函数声明 
****************************************************************************/ 

void Delayms(uint);                // 延时函数 
void InitLed(void);                // 初始化LED函数 
void InitKey(void);                // 按键初始化函数 
uchar KeyScanS1(void);             // 按键S1检测函数 
uchar KeyScanS2(void);             // 按键S2检测函数 

/**************************************************************************** 
* 名       称: Delayms() 
* 功       能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确) 
* 入口参数: msec 延时参数，值越大，延时越久 
* 出口参数: 无 
****************************************************************************/ 
void Delayms(uint time) 
{ 
    uint i, j; 
    for (i=0; i<time; i++) 
        for (j=0; j<535; j++); 
} 

/**************************************************************************** 
* 名       称: InitLed() 
* 功       能: 设置LED相应的IO口 
* 入口参数: 无 
* 出口参数: 无 
****************************************************************************/ 
void InitLed(void) 
{ 
    P1SEL &= ~0x13;     // 设置P1.0、P1.1、P1.2为普通IO口 
    P1DIR |= 0x13;      // P1.0、P1.1、P1.2定义为输出 
    LED1 = 0;           // LED1灯初始化为熄灭状态 
    LED2 = 0;           // LED2灯初始化为熄灭状态 
    LED3 = 0;           // LED3灯初始化为熄灭状态 
} 

/**************************************************************************** 
* 名       称: InitKey() 
* 功       能: 设置按键相应的IO口 
* 入口参数: 无 
* 出口参数: 无 
****************************************************************************/ 
void InitKey(void) 
{ 
    P0SEL &= ~0x03;            // 设置P0.0、P0.1为普通IO口 
    P0DIR &= ~0x03;            // 按键接在P0.0和P0.1口上，设P0.0和P0.1为输入模式 
    P0INP &= ~0x03;            // 设置P0.0和P0.1上/拉电阻 
    P2INP &= ~0x20;            // 设置 P0.0 上拉电阻 
} 

/**************************************************************************** 
* 名       称: KeyScanS1() 
* 功       能: 读取按键S1状态 
* 入口参数: 无 
* 出口参数: 0为松开，1为按键按下 
****************************************************************************/ 
uchar KeyScanS1(void) 
{ 
    if (S1 == 0) 
    { 
        Delayms(10); 
        if (S1 == 0) 
        { 
            while(!S1); // 松手检测 
            return 1;   // 有按键按下 
        } 
    } 
    return 0; // 无按键按下 
} 

/**************************************************************************** 
* 名       称: KeyScanS2() 
* 功       能: 读取按键S2状态 
* 入口参数: 无 
* 出口参数: 0为松开，1为按键按下 
****************************************************************************/ 
uchar KeyScanS2(void) 
{ 
    if (S2 == 0) 
    { 
        Delayms(10); 
        if (S2 == 0) 
        { 
            while(!S2); // 松手检测 
            return 1;   // 有按键按下 
        } 
    } 
    return 0; // 无按键按下 
} 

/**************************************************************************** 
* 程序入口函数 
****************************************************************************/ 
void main(void) 
{ 
    uchar state = 0; // 用于控制跑马灯状态
    uchar flag = 0;  // 用于控制同时闪烁状态

    InitLed();       // 设置LED相应的IO口 
    InitKey();       // 设置按键相应的IO口 

    while(1) 
    {   
        // 按键S1控制跑马灯
        if (KeyScanS1())
        {
            state = 1; // 开始跑马灯
        }
        if (state)
        {
            LED1 = 1; LED2 = 0; LED3 = 0; Delayms(500);
            LED1 = 0; LED2 = 1; LED3 = 0; Delayms(500);
            LED1 = 0; LED2 = 0; LED3 = 1; Delayms(500);
        }

        // 按键S2控制LED1、LED2、LED3同时闪烁
        if (KeyScanS2())
        {
            flag = 1; // 开始闪烁
        }
        if (flag)
        {
            LED1 = LED2 = LED3 = 1; Delayms(1000); // 延时1s
            LED1 = LED2 = LED3 = 0; Delayms(1000); // 延时1s
            LED1 = LED2 = LED3 = 1; Delayms(1000); // 延时1s
            LED1 = LED2 = LED3 = 0; Delayms(1000); // 延时1s
            flag = 0; // 停止闪烁
        }
    } 
}