/****************************************************************************
* 文 件 名: main.c
* 作 者: ZT
* 修 订: 2025-04-11
* 版 本: 1.0
* 描 述: 定时器 T3 通过中断方式控制 LED1 周期性闪烁
****************************************************************************/
#include <ioCC2530.h>
typedef unsigned char uchar;
typedef unsigned int uint;
#define LED1 P1_0 // P1.0 口控制 LED1
#define LED2 P1_1 // P1.1 口控制 LED2
uint count; //用于定时器计数
/********************************************************************
********
* 名 称: InitLed()
* 功 能: 设置 LED 灯相应的 IO 口
* 入口参数: 无
* 出口参数: 无
*********************************************************************
*******/
void InitLed(void)
{
  P1DIR |= 0x03; //P1.0 定义为输出
  LED1 = 0; //使 LED1 灯上电默认为熄灭
  LED2 = 1;
}
/********************************************************************
********
* 名 称: InitT3()
* 功 能: 定时器初始化，系统不配置工作时钟时默认是 2 分频，即 16MHz
* 入口参数: 无
* 出口参数: 无
*********************************************************************
*******/
void InitT3()
{
  T3CTL |= 0x08 ; //开溢出中断
  T3IE = 1; //开总中断和 T3 中断
  T3CTL |= 0xE0; //128 分频,128/16000000*N=0.5S,N=62500
  T3CTL &= ~0x03; //自动重装 00－>0xff 62500/255=245(次)
  T3CTL |= 0x10; //启动
  EA = 1; //开总中断
}
//定时器 T3 中断处理函数
#pragma vector = T3_VECTOR
__interrupt void T3_ISR(void)
{
  IRCON = 0x00; 
  count++;
  if (LED2 == 1) 
  {
   if (count >= 244) 
   {
    count = 0;
    LED2 = 0;
   }
  } 
  else 
  {
   if (count >= 732) 
   {
    count = 0;
    LED2 = 1;
   }
  }
}
/********************************************************************
程序入口函数
********************************************************************/
void main(void)
{
  InitLed(); //设置 LED 灯相应的 IO 口
  InitT3(); //设置 T3 相应的寄存器
  while(1)
  {};
}